Repository: Jenli-dev/ig-planner-ios
Catalog: *.lproj/Localizable.strings
Languages: ms, th, uk

# settings.title
source: Settings
ms: Tetapan
th: การตั้งค่า
uk: Налаштування

# settings.manage_subscription
source: Manage Subscription
ms: Urus Langganan
th: จัดการการสมัครสมาชิก
uk: Керування підпискою

# settings.manage_subscription.subtitle
source: Change or cancel your plan
ms: Tukar atau batal pelan anda
th: เปลี่ยนหรือยกเลิกแผนของคุณ
uk: Змінити або скасувати план

# settings.go_pro
source: Go PRO
ms: Jadilah PRO
th: อัปเกรดเป็น PRO
uk: Стати PRO

# settings.go_pro.subtitle
source: Unlock all insights & tools
ms: Buka kunci semua wawasan & alatan
th: ปลดล็อกข้อมูลเชิงลึกและเครื่องมือทั้งหมด
uk: Розблокувати всі функції та інструменти

# settings.restore_purchases
source: Restore Purchases
ms: Pulihkan Pembelian
th: กู้คืนการซื้อ
uk: Відновити покупки

# settings.restore_purchases.subtitle
source: Re-activate your PRO on this device
ms: Aktifkan semula PRO anda pada peranti ini
th: เปิดใช้งาน PRO ใหม่บนอุปกรณ์นี้
uk: Реактивувати PRO на цьому пристрої

# settings.language
source: Language
ms: Bahasa
th: ภาษา
uk: Мова

# settings.language.subtitle
source: Choose app language
ms: Pilih bahasa aplikasi
th: เลือกภาษาของแอป
uk: Вибрати мову додатку

# settings.diagnostics
source: Diagnostics
ms: Diagnostik
th: การวินิจฉัย
uk: Діагностика

# settings.ping_backend
source: Ping Backend
ms: Semak Backend
th: ตรวจสอบ Backend
uk: Перевірити Backend

# settings.about
source: About
ms: Mengenai
th: เกี่ยวกับ
uk: Про додаток

# settings.terms_of_use
source: Terms of Use
ms: Terma Penggunaan
th: ข้อกำหนดการใช้งาน
uk: Умови використання

# settings.privacy_policy
source: Privacy Policy
ms: Dasar Privasi
th: นโยบายความเป็นส่วนตัว
uk: Політика конфіденційності

# status.pro_active
source: PRO active
ms: PRO aktif
th: PRO เปิดใช้งาน
uk: PRO активний

# status.free_mode
source: Free mode
ms: Mod percuma
th: โหมดฟรี
uk: Безкоштовний режим

# status.pro_thanks
source: Thanks for supporting us! 🎉
ms: Terima kasih atas sokongan anda! 🎉
th: ขอบคุณสำหรับการสนับสนุน! 🎉
uk: Дякуємо за підтримку! 🎉

# status.unlock_all
source: Unlock all insights and tools
ms: Buka kunci semua wawasan dan alatan
th: ปลดล็อกข้อมูลเชิงลึกและเครื่องมือทั้งหมด
uk: Розблокувати всі функції та інструменти

# status.upgrade
source: Upgrade
ms: Naik taraf
th: อัปเกรด
uk: Оновити

# common.cancel
source: Cancel
ms: Batal
th: ยกเลิก
uk: Скасувати

# common.save
source: Save
ms: Simpan
th: บันทึก
uk: Зберегти

# common.delete
source: Delete
ms: Padam
th: ลบ
uk: Видалити

# common.edit
source: Edit
th: แก้ไข
uk: Редагувати

# common.done
source: Done
ms: Selesai
th: เสร็จสิ้น
uk: Готово

# common.close
source: Close
ms: Tutup
th: ปิด
uk: Закрити

# common.ok
source: OK
th: ตกลง

# common.error
source: Error
ms: Ralat
th: ข้อผิดพลาด
uk: Помилка

# common.loading
source: Loading...
ms: Memuatkan...
th: กำลังโหลด...
uk: Завантаження...

# common.refresh
source: Refresh
ms: Muat semula
th: รีเฟรช
uk: Оновити

# analytics.title
source: Analytics
ms: Analitik
th: การวิเคราะห์
uk: Аналітика

# analytics.last_update
source: Last update
ms: Kemaskini terakhir
th: อัปเดตล่าสุด
uk: Останнє оновлення

# analytics.top_posts
source: Top posts
ms: Catatan teratas
th: โพสต์ยอดนิยม
uk: Топ публікацій

# post_planner.title
source: Post Planner
ms: Pelan Catatan
th: ตัววางแผนโพสต์
uk: Планувальник постів

# post_planner.no_scheduled
source: No scheduled posts yet
ms: Tiada catatan yang dijadualkan
th: ยังไม่มีโพสต์ที่กำหนดเวลา
uk: Немає запланованих постів

# post_planner.no_scheduled.subtitle
source: Tap "+ Schedule" or use Publish flow to add a post.
ms: Ketuk "+ Jadual" atau gunakan aliran Terbitkan untuk menambah catatan.
th: แตะ "+ กำหนดเวลา" หรือใช้ขั้นตอนการเผยแพร่เพื่อเพิ่มโพสต์
uk: Натисніть "+ Запланувати" або використайте публікацію для додавання поста.

# post_planner.your_media
source: Your media
ms: Media anda
th: สื่อของคุณ
uk: Ваші медіа

# post_planner.add_photos
source: Add photos from Library
ms: Tambah foto dari Pustaka
th: เพิ่มรูปภาพจากไลบรารี
uk: Додати фото з бібліотеки

# post_planner.schedule_post
source: Schedule post
ms: Jadual catatan
th: กำหนดเวลาโพสต์
uk: Запланувати пост

# ai.chat.title
source: AI Chat
ms: Chat AI
th: แชท AI
uk: AI Чат

# ai.chat.placeholder
source: Write a message…
ms: Tulis mesej…
th: เขียนข้อความ…
uk: Напишіть повідомлення…

# ai.chat.greeting
source: Hey! Ask me anything about your posts, analytics, or ideas ✨
ms: Hai! Tanya saya tentang catatan, analitik, atau idea anda ✨
th: สวัสดี! ถามฉันเกี่ยวกับโพสต์ การวิเคราะห์ หรือไอเดียของคุณ ✨
uk: Привіт! Запитай мене про пости, аналітику або ідеї ✨

# ai.chat.error
source: Oops, I couldn't reply right now. Please try again.
ms: Ups, saya tidak dapat membalas sekarang. Sila cuba lagi.
th: ขออภัย ฉันไม่สามารถตอบได้ตอนนี้ กรุณาลองอีกครั้ง
uk: Упс, я не зміг відповісти зараз. Будь ласка, спробуйте ще раз.

# photo_editor.title
source: Photo Editor
ms: Editor Foto
th: ตัวแก้ไขรูปภาพ
uk: Редактор фото

# photo_editor.subtitle
source: Create better visuals
ms: Cipta visual yang lebih baik
th: สร้างภาพที่ดีขึ้น
uk: Створюйте кращі візуали

# photo_editor.description
source: Quick tools for filters, covers, watermark & resize.
ms: Alat pantas untuk penapis, sampul, tandatangan air & saiz semula.
th: เครื่องมือด่วนสำหรับตัวกรอง หน้าปก ลายน้ำ และปรับขนาด
uk: Швидкі інструменти для фільтрів, обкладинок, водяних знаків та зміни розміру.

# photo_editor.filters
source: Filters
ms: Penapis
th: ตัวกรอง
uk: Фільтри

# photo_editor.filters.subtitle
source: Photo & Video
ms: Foto & Video
th: รูปภาพและวิดีโอ
uk: Фото та Відео

# photo_editor.covers
source: Covers
ms: Sampul
th: หน้าปก
uk: Обкладинки

# photo_editor.covers.subtitle
source: Reels & Posts
ms: Reels & Catatan
th: รีลส์และโพสต์
uk: Reels та Пости

# photo_editor.watermark
source: Watermark
ms: Tandatangan air
th: ลายน้ำ
uk: Водяний знак

# photo_editor.watermark.subtitle
source: Logo overlay
ms: Overlay logo
th: โอเวอร์เลย์โลโก้
uk: Накладення логотипу

# photo_editor.resize
source: Resize
ms: Saiz semula
th: ปรับขนาด
uk: Змінити розмір

# photo_editor.resize.subtitle
source: Crop & fit
ms: Potong & muat
th: ครอบตัดและปรับ
uk: Обрізати та підігнати

# photo_editor.all_unlocked
source: All editor features unlocked.
ms: Semua ciri editor dibuka kunci.
th: ฟีเจอร์ตัวแก้ไขทั้งหมดปลดล็อกแล้ว
uk: Всі функції редактора розблоковані.

# photo_editor.some_locked
source: Some tools require Pro.
ms: Beberapa alatan memerlukan Pro.
th: เครื่องมือบางอย่างต้องใช้ Pro
uk: Деякі інструменти вимагають Pro.
